fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ПериодДействияДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_АбонентскаяПлатаМесяц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботыСпециалиста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДобавляемыеРеквизиты = Новый Массив;
	 
	ПериодРеквизит = Новый РеквизитФормы("ПериодДействия", Новый ОписаниеТипов("СтандартныйПериод"), , "Период действия");
	ДобавляемыеРеквизиты.Добавить(ПериодРеквизит);
	
	ЭтотОбъект.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	 
	
	ЭлементПериодДействия = Элементы.Добавить("ПериодДействия", Тип("ПолеФормы"));
	ЭлементПериодДействия.Вид = ВидПоляФормы.ПолеВвода; 
	ЭлементПериодДействия.ПутьКДанным = "ПериодДействия";
	ЭлементПериодДействия.Видимость = Ложь;
	
	ЭлементАбонентскаяПлата = Элементы.Добавить("АбонентскаяПлата", Тип("ПолеФормы"));
	ЭлементАбонентскаяПлата.Вид = ВидПоляФормы.ПолеВвода; 
	ЭлементАбонентскаяПлата.ПутьКДанным = "Объект.ВКМ_АбонентскаяПлатаМесяц";
	ЭлементАбонентскаяПлата.Видимость = Ложь;
	
	ЭлементСтоимость = Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"));
	ЭлементСтоимость.Вид = ВидПоляФормы.ПолеВвода; 
	ЭлементСтоимость.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботыСпециалиста";
	ЭлементСтоимость.Видимость = Ложь;
				
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		Элементы.ПериодДействия.Видимость = Истина;
		Элементы.АбонентскаяПлата.Видимость = Истина;
		Элементы.СтоимостьЧасаРаботы.Видимость = Истина;
	Иначе
		Элементы.ПериодДействия.Видимость = Ложь;
		Элементы.АбонентскаяПлата.Видимость = Ложь;
		Элементы.СтоимостьЧасаРаботы.Видимость = Ложь;	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
